In [1]:
import pandas as pd
import numpy as np

# Eksik Veri

In [2]:
dictData = {'Istanbul' : [30, 29, np.nan], 'Ankara' : [20, np.nan, 25], 'Izmir' : [40, 39, 38]}
weatherDataFrame = pd.DataFrame(dictData)

In [3]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
 weatherDataFrame.dropna()  #bir satırda NaN varsa direkt tüm o satırı siler

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
weatherDataFrame.dropna(axis = 1)  #NaN içeren tüm sütunları siler

   Izmir
0     40
1     39
2     38

In [13]:
newDictData = {'Istanbul' : [30, 29, np.nan], 'Ankara' : [20, np.nan, 25], 'Izmir' : [40, 39, 38], 'Antaly' : [45, np.nan, np.nan]}
newWeatherDataFrame = pd.DataFrame(newDictData)

In [14]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Antaly
0      30.0    20.0     40    45.0
1      29.0     NaN     39     NaN
2       NaN    25.0     38     NaN

In [15]:
newWeatherDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [19]:
newWeatherDataFrame.fillna(0)   #NaN olanlara verilen parametreyi yazar

   Istanbul  Ankara  Izmir  Antaly
0      30.0    20.0     40    45.0
1      29.0     0.0     39     0.0
2       0.0    25.0     38     0.0

In [21]:
newWeatherDataFrame.fillna('Veri Yok')

   Istanbul    Ankara  Izmir    Antaly
0      30.0      20.0     40      45.0
1      29.0  Veri Yok     39  Veri Yok
2  Veri Yok      25.0     38  Veri Yok

# Groupby

In [25]:
salaryDict = {'Departmanlar' : ['Yazılım', 'Yazılım', 'Finans', 'Finans', 'Hukuk', 'Hukuk'],
                                'Calısan İsmi' : ['İlhan', 'Mehmet', 'İlayda', 'Mahmut', 'Zübeyde', 'Ayse'],
                                'Maas' : [2000, 3000, 4000, 5000, 6000, 7000]}

In [26]:
maasDataFrame = pd.DataFrame(salaryDict)

In [27]:
maasDataFrame

  Departmanlar Calısan İsmi  Maas
0      Yazılım        İlhan  2000
1      Yazılım       Mehmet  3000
2       Finans       İlayda  4000
3       Finans       Mahmut  5000
4        Hukuk      Zübeyde  6000
5        Hukuk         Ayse  7000

In [39]:
groupObject = maasDataFrame.groupby('Departmanlar')

In [40]:
groupObject.count()

              Calısan İsmi  Maas
Departmanlar
Finans                   2     2
Hukuk                    2     2
Yazılım                  2     2

In [43]:
groupObject.min()

             Calısan İsmi  Maas
Departmanlar
Finans             Mahmut  4000
Hukuk                Ayse  6000
Yazılım            Mehmet  2000

In [44]:
groupObject.max()

             Calısan İsmi  Maas
Departmanlar
Finans             İlayda  5000
Hukuk             Zübeyde  7000
Yazılım             İlhan  3000

In [46]:
groupObject.describe()    #tüm featureları önüne getirir

              Maas
             count    mean         std     min     25%     50%     75%     max
Departmanlar
Finans         2.0  4500.0  707.106781  4000.0  4250.0  4500.0  4750.0  5000.0
Hukuk          2.0  6500.0  707.106781  6000.0  6250.0  6500.0  6750.0  7000.0
Yazılım        2.0  2500.0  707.106781  2000.0  2250.0  2500.0  2750.0  3000.0